#ifndef KAL_KEYDEVICE_H
#define KAL_KEYDEVICE_H

/*
*********************************************************************************************************
*	函 数 名: KAL_KEYDeviceInit
*	功能说明: 内核抽象层的按键初始化函数, 内核不一样时请修改此函数
*	形    参: ptInputEvent-输入事件
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/12    V1.0        @尝试早睡
*********************************************************************************************************
*/
void  KAL_KEYDeviceInit(void);

#endif // !CAL_KEYDEVICE_H