
#ifndef KEY_DEVICE_H
#define KEY_DEVICE_H

#define K1_CODE 1

/**********************************************************************
 * 函数名称： AddInputDeviceKey
 * 功能描述： 注册GPIO按键设备
 * 输入参数： 无
 * 输出参数： 无
 * 返 回 值： 无
 * 修改日期        版本号        修改人	          修改内容
 * -----------------------------------------------
 * 2023/11/17	   V1.0	    Embedded Lin	      创建
 ***********************************************************************/
extern void AddInputDeviceKey(void);

#endif /* __GPIO_KEY_H */

