#ifndef _ENCODING_MANAGER_H
#define _ENCODING_MANAGER_H

#include <display_device.h>
#include <fonts_manager.h>

typedef struct EncodingOpr
{
    char *name;  /*编码格式名*/
    int iHeadLen; /*编码格式头长度*/
    PT_FontOpr ptFontOprSupportedHead; /*支持该编码格式的字体*/
    int (*isSupport)(unsigned char *pucBufHead); /*是否支持该编码格式*/
    int (*GetCodeFrmBuf)(unsigned char *pucBufStart, unsigned char *pucBufEnd, unsigned int *pdwCode); /*获取编码格式*/
    struct EncodingOpr *ptNext; /*编码链表结构体指针*/
} T_EncodingOpr, *PT_EncodingOpr;

/*
*********************************************************************************************************
*	函 数 名: RegisterEncodingOpr
*	功能说明: 通过单链表注册编码
*	形    参: dwCode - 字符编码  ptFontBitMap - 字体位图存储位置
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/11    V1.0        @尝试早睡
*********************************************************************************************************
*/
int RegisterEncodingOpr(PT_EncodingOpr ptEncodingOpr);

/*
*********************************************************************************************************
*	函 数 名: ShowEncodingOpr
*	功能说明: 打印出所以的编码格式
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/11    V1.0        @尝试早睡
*********************************************************************************************************
*/
void ShowEncodingOpr(void);

/*
*********************************************************************************************************
*	函 数 名: GetDispOpr
*	功能说明: 通过显示设备名字获取设备结构体指针
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/11    V1.0        @尝试早睡
*********************************************************************************************************
*/
PT_DispOpr GetDispOpr(char *pcName);

/*
*********************************************************************************************************
*	函 数 名: SelectEncodingOprForFile
*	功能说明: 选择文件的编码格式
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/11    V1.0        @尝试早睡
*********************************************************************************************************
*/
PT_EncodingOpr SelectEncodingOprForFile(unsigned char *pucFileBufHead);

/*
*********************************************************************************************************
*	函 数 名: AddFontOprForEncoding
*	功能说明: 为编码格式添加字体
*	形    参: ptEncodingOpr - 编码格式  ptFontOpr - 字体
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/11    V1.0        @尝试早睡
*********************************************************************************************************
*/
int AddFontOprForEncoding(PT_EncodingOpr ptEncodingOpr, PT_FontOpr ptFontOpr);

/*
*********************************************************************************************************
*	函 数 名: DelFontOprFrmEncoding
*	功能说明: 删除字体的编码格式
*	形    参: ptEncodingOpr - 编码格式  ptFontOpr - 字体
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/11    V1.0        @尝试早睡
*********************************************************************************************************
*/
int DelFontOprFrmEncoding(PT_EncodingOpr ptEncodingOpr, PT_FontOpr ptFontOpr);

/*
*********************************************************************************************************
*	函 数 名: EncodingInit
*	功能说明: 全部编码格式初始化
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/11    V1.0        @尝试早睡
*********************************************************************************************************
*/
int EncodingInit(void);

/*
*********************************************************************************************************
*	函 数 名: AsciiEncodingInit
*	功能说明: ASCII编码初始化,给其他函数调用
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/11    V1.0        @尝试早睡
*********************************************************************************************************
*/
int AsciiEncodingInit(void);

/*
*********************************************************************************************************
*	函 数 名: Utf16beEncodingInit
*	功能说明: 初始化UTF-16be编码,给其他函数调用
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/11    V1.0        @尝试早睡
*********************************************************************************************************
*/
int Utf16beEncodingInit(void);

/*
*********************************************************************************************************
*	函 数 名: Utf16leEncodingInit
*	功能说明: 初始化UTF-16le编码,给其他函数调用
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/11    V1.0        @尝试早睡
*********************************************************************************************************
*/
int Utf16leEncodingInit(void);

/*
*********************************************************************************************************
*	函 数 名: Utf8EncodingInit
*	功能说明: 初始化UTF-8编码,给其他函数调用
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/11    V1.0        @尝试早睡
*********************************************************************************************************
*/
int Utf8EncodingInit(void);

#endif /* _ENCODING_MANAGER_H */