#ifndef __INPUT_BUFFER_H
#define __INPUT_BUFFER_H

#include "main.h"

#define No_OS 0
#define FreeRTOS 0
#define Linux 1

#define BUFFER_SIZE 1024 /* 环形缓冲区的大小 */

typedef struct
{
    InputEvent buffer[BUFFER_SIZE]; /* 缓冲区空间 */
    volatile unsigned int pW;       /* 写地址 */
    volatile unsigned int pR;       /* 读地址 */
} InputEventBuffer;

extern int msgid;

#if No_OS||FreeRTOS

/*
*********************************************************************************************************
*	函 数 名: InitInputQueue
*	功能说明: 初始化环形缓冲区
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/12    V1.0        @尝试早睡
*********************************************************************************************************
*/
int InitInputQueue(void);

/*
*********************************************************************************************************
*	函 数 名: PutInputEvent
*	功能说明: 往环形缓冲区放入数据
*	形    参: ptInputEvent-输入事件
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/12    V1.0        @尝试早睡
*********************************************************************************************************
*/
int PutInputEvent(PInputEvent ptInputEvent);

/*
*********************************************************************************************************
*	函 数 名: GetInputEvent
*	功能说明: 获取环形缓冲区数据
*	形    参: ptInputEvent-输入事件
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/12    V1.0        @尝试早睡
*********************************************************************************************************
*/
int GetInputEvent(PInputEvent ptInputEvent);

#elif Linux 

/*
*********************************************************************************************************
*	函 数 名: InitInputQueue
*	功能说明: 初始化环形缓冲区
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/12    V1.0        @尝试早睡
*********************************************************************************************************
*/
int InitInputQueue(void);

/*
*********************************************************************************************************
*	函 数 名: PutInputEvent
*	功能说明: 往环形缓冲区放入数据
*	形    参: ptInputEvent-输入事件
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/12    V1.0        @尝试早睡
*********************************************************************************************************
*/
int PutInputEvent(struct input_event* ptInputEvent);

/*
*********************************************************************************************************
*	函 数 名: GetInputEvent
*	功能说明: 获取环形缓冲区数据
*	形    参: ptInputEvent-输入事件
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/12    V1.0        @尝试早睡
*********************************************************************************************************
*/
int GetInputEvent(struct input_event* ptInputEvent);

#endif

#endif /* __INPUT_BUFFER_H */
