
#ifndef KEY_DEVICE_H
#define KEY_DEVICE_H

#define K1_CODE 1 /*按键编号*/

/*
*********************************************************************************************************
*	函 数 名: AddInputDeviceKey
*	功能说明: 注册GPIO按键设备
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/12    V1.0        @尝试早睡
*********************************************************************************************************
*/
void AddInputDeviceKey(void);

#endif /* __GPIO_KEY_H */

