#ifndef UART_RINGBUFFER_H
#define UART_RINGBUFFER_H

#define BUFFER_SIZE 1024 /* 环形缓冲区的大小 */

typedef struct UartMessage
{
    short mtype;            // 消息类型
    char mbuf[BUFFER_SIZE]; /* 缓冲区空间 */
} UartMessage,*ptUartMessage;

/*
*********************************************************************************************************
*	函 数 名: InitUartEvent
*	功能说明: 初始化串口环形缓冲区
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/12    V1.0        @尝试早睡
*********************************************************************************************************
*/
int InitUartEvent(void);

/*
*********************************************************************************************************
*	函 数 名: PutUartEvent
*	功能说明: 往串口环形缓冲区放入数据
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/12    V1.0        @尝试早睡
*********************************************************************************************************
*/
int PutUartEvent(ptUartMessage ptUartEvent);

/*
*********************************************************************************************************
*	函 数 名: GetUartEvent
*	功能说明: 获取串口环形缓冲区数据
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/12    V1.0        @尝试早睡
*********************************************************************************************************
*/
int GetUartEvent( ptUartMessage ptUartEvent);

#endif /* UART_RINGBUFFER_H */