#include "main.h"
#include "key_device.h"

/*
*********************************************************************************************************
*	函 数 名: KEYDeviceInit
*	功能说明: 初始化GPIO按键
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/12    V1.0        @尝试早睡
*********************************************************************************************************
*/
static int KEYDeviceInit(void)
{
	KAL_KEYDeviceInit();
	return 0;
}

/* 为GPIO按键构造一个InputDevice */
static InputDevice g_tKeyDevice = {
	 -1,
	"gpio_key",
	NULL,
	KEYDeviceInit,
	NULL,
	NULL,
};

/*
*********************************************************************************************************
*	函 数 名: AddInputDeviceKey
*	功能说明: 初始化GPIO按键,提供给其他函数调用
*	形    参: 无
*	返 回 值: 无
*   日期          版本号        修改人
*   2023/12/12    V1.0        @尝试早睡
*********************************************************************************************************
*/
void AddInputDeviceKey(void)
{
	InputDeviceRegister(&g_tKeyDevice);
}


